# -*- coding: utf-8 -*-

QUEST_URL = 'http://cn.60wdb.com/quest/{}'
ZONE_URL = 'http://cn.60wdb.com/zone/{}'

SILVER_FORMAT = '[color=silver]{}[/color]'
QUEST_FORMAT = '[*][url=http://cn.60wdb.com/quest/{}]{}[/url]  {} -> {}'
TR_FORMAT = """[tr]
[td][align=center]{}[/align][/td]
[td][b]{}[/b]
[color=red][/color][/td]
[td][list]
{}
[/list][/td]
[/tr]"""
TABLE_FORMAT = """[table]
{}
[/table]"""

IMG_A = '[img]./mon_201906/11/-ah8mQ5-dgwfK1S8-e.gif[/img]'
IMG_H = '[img]./mon_201906/11/-ah8mQ5-84dqK1Se-e.gif[/img]'

ZID2NAME = {
    '209': '影牙城堡',
    '491': '剃刀沼泽',
    '717': '监狱',
    '718': '哀嚎洞穴',
    '719': '黑暗深渊',
    '721': '诺莫瑞根',
    '722': '剃刀高地',
    '796': '血色修道院',
    '1176': '祖尔法拉克',
    '1337': '奥达曼',
    '1417': '沉没的神庙',
    '1581': '死亡矿井',
    '1583': '黑石塔',
    '1584': '黑石深渊',
    '2017': '斯坦索姆',
    '2057': '通灵学院',
    '2100': '玛拉顿',
    '2437': '怒焰裂谷',
    '2557': '厄运之槌'
}

NAME2ZID = {
    '剃刀沼泽': '491',
    '剃刀高地': '722',
    '厄运之槌': '2557',
    '哀嚎洞穴': '718',
    '奥达曼': '1337',
    '影牙城堡': '209',
    '怒焰裂谷': '2437',
    '斯坦索姆': '2017',
    '死亡矿井': '1581',
    '沉没的神庙': '1417',
    '玛拉顿': '2100',
    '监狱': '717',
    '祖尔法拉克': '1176',
    '血色修道院': '796',
    '诺莫瑞根': '721',
    '通灵学院': '2057',
    '黑暗深渊': '719',
    '黑石塔': '1583',
    '黑石深渊': '1584'
}
